app/views/servers/index.html.erb

              <table>
                <% server.repos.each do |repo| %>
---
SELECT "repos".* FROM "repos" WHERE "repos"."server_id" = ?  [["server_id", 1]]