app/controllers/servers_controller.rb

DELETE FROM "servers" WHERE "servers"."id" = ?  [["id", 1]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def delete_server
    Server.find_by_id(params[:id]).destroy

SELECT  "servers".* FROM "servers" WHERE "servers"."server_name" = ? LIMIT ?  [["server_name", "barrysdev2"], ["LIMIT", 1]]
INSERT INTO "servers" ("server_name", "server_order", "server_group", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["server_name", "barrysdev2"], ["server_order", 100], ["server_group", 1], ["created_at", 2016-11-14 15:28:19 UTC], ["updated_at", 2016-11-14 15:28:19 UTC]]
SELECT  "repos".* FROM "repos" WHERE "repos"."server_id" = ? AND "repos"."repo_name" = ? ORDER BY "repos"."id" ASC LIMIT ?  [["server_id", 6], ["repo_name", "Rest API"], ["LIMIT", 1]]
INSERT INTO "repos" ("server_id", "repo_name", "current_branch_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["server_id", 1], ["repo_name", "Rest API"], ["current_branch_name", "develop"], ["created_at", 2016-11-14 15:37:11 UTC], ["updated_at", 2016-11-14 15:37:11 UTC]]
UPDATE "repos" SET "current_branch_name" = ?, "updated_at" = ? WHERE "repos"."id" = ?  [["current_branch_name", "master"], ["updated_at", 2016-11-14 15:38:46 UTC], ["id", 3]]
SELECT  "repos".* FROM "repos" WHERE "repos"."repo_name" = ? LIMIT ?  [["repo_name", "Rest API"], ["LIMIT", 1]]
---
  def snitch
    server = Server.find_by_server_name(params[:server_name])
    if !server
      server = Server.new(server_name: params[:server_name])
    end
    server.server_group = params[:server_group]
    server.server_order = params[:server_order]

    if !server.save()
      puts server.errors.full_messages.join(", ")
    end

    repo = Repo.where(server_id: server.id, repo_name: params[:branch_label]).first
    if !repo
      repo = Repo.new(repo_name: params[:branch_label], server_id: server.id)
    end
    repo.current_branch_name = params[:branch_name]
    repo.current_branch_status = params[:branch_status]
    repo.current_branch_log = params[:branch_log]

    if !repo.save()
      puts server.id
      puts repo.errors.full_messages.join(", ")